RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/hbn_reg.h
    /* 0x104 : HBN_RSV1 */
    union {
        struct
        {
            uint32_t HBN_RSV1 : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } HBN_RSV1;

    /* 0x108 : HBN_RSV2 */
    union {
        struct
        {
            uint32_t HBN_RSV2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_RSV2;

    /* 0x10C : HBN_RSV3 */
    union {
        struct
        {
            uint32_t HBN_RSV3 : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } HBN_RSV3;

    /* 0x110  reserved */
    uint8_t RESERVED0x110[240];

    /* 0x200 : rc32k_ctrl0 */
    union {
        struct
        {
            uint32_t rc32k_cal_done        : 1;  /* [    0],          r,        0x1 */
            uint32_t rc32k_rdy             : 1;  /* [    1],          r,        0x1 */
            uint32_t rc32k_cal_inprogress  : 1;  /* [    2],          r,        0x0 */
            uint32_t rc32k_cal_div         : 2;  /* [ 4: 3],        r/w,        0x3 */
            uint32_t rc32k_cal_precharge   : 1;  /* [    5],          r,        0x0 */
            uint32_t rc32k_dig_code_fr_cal : 10; /* [15: 6],          r,      0x200 */
            uint32_t rc32k_vref_dly        : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t rc32k_allow_cal       : 1;  /* [   18],        r/w,        0x0 */
            uint32_t rc32k_ext_code_en     : 1;  /* [   19],        r/w,        0x1 */
            uint32_t rc32k_cal_en          : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reserved_21           : 1;  /* [   21],       rsvd,        0x0 */
            uint32_t rc32k_code_fr_ext     : 10; /* [31:22],        r/w,      0x12c */
        } BF;
        uint32_t WORD;
    } rc32k_ctrl0;

    /* 0x204 : xtal32k */
    union {
        struct
        {
            uint32_t xtal32k_hiz_en       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t xtal32k_lowv_en      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t xtal32k_ext_sel      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t xtal32k_amp_ctrl     : 2;  /* [ 4: 3],        r/w,        0x1 */
            uint32_t xtal32k_reg          : 2;  /* [ 6: 5],        r/w,        0x1 */
            uint32_t xtal32k_outbuf_stre  : 1;  /* [    7],        r/w,        0x0 */
            uint32_t xtal32k_otf_short    : 1;  /* [    8],        r/w,        0x0 */
            uint32_t xtal32k_inv_stre     : 2;  /* [10: 9],        r/w,        0x1 */
            uint32_t xtal32k_capbank      : 6;  /* [16:11],        r/w,       0x20 */
            uint32_t xtal32k_ac_cap_short : 1;  /* [   17],        r/w,        0x1 */
            uint32_t pu_xtal32k_buf       : 1;  /* [   18],        r/w,        0x1 */
            uint32_t pu_xtal32k           : 1;  /* [   19],        r/w,        0x1 */
            uint32_t reserved_20_31       : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } xtal32k;
};

typedef volatile struct hbn_reg hbn_reg_t;

#endif /* __HBN_REG_H__ */
